report/sysbench/TiDB_test/oltp_delete.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 13711.81 qps: 13711.81 (r/w/o: 0.00/13591.89/119.92) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 14475.89 qps: 14475.89 (r/w/o: 0.00/14105.09/370.80) lat (ms,99%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 10878.84 qps: 10878.84 (r/w/o: 0.00/10433.04/445.80) lat (ms,99%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 14799.97 qps: 14799.97 (r/w/o: 0.00/13964.97/835.00) lat (ms,99%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 14827.78 qps: 14827.78 (r/w/o: 0.00/13728.18/1099.60) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 15013.56 qps: 15013.56 (r/w/o: 0.00/13657.96/1355.60) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 15328.05 qps: 15328.05 (r/w/o: 0.00/13672.47/1655.58) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 15603.45 qps: 15603.45 (r/w/o: 0.00/13664.44/1939.01) lat (ms,99%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 15285.97 qps: 15285.97 (r/w/o: 0.00/13102.77/2183.20) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 15517.84 qps: 15517.84 (r/w/o: 0.00/13051.83/2466.01) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 16447.57 qps: 16447.57 (r/w/o: 0.00/13540.98/2906.60) lat (ms,99%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 16582.54 qps: 16582.54 (r/w/o: 0.00/13398.19/3184.35) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 16440.68 qps: 16440.68 (r/w/o: 0.00/12993.82/3446.86) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 16976.79 qps: 16976.79 (r/w/o: 0.00/13171.55/3805.24) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 15032.24 qps: 15032.24 (r/w/o: 0.00/11400.23/3632.01) lat (ms,99%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 17405.55 qps: 17405.55 (r/w/o: 0.00/12984.36/4421.19) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 17362.42 qps: 17362.42 (r/w/o: 0.00/12647.67/4714.75) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 17574.61 qps: 17574.61 (r/w/o: 0.00/12557.81/5016.80) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 17832.38 qps: 17832.38 (r/w/o: 0.00/12429.39/5402.99) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 18966.71 qps: 18966.71 (r/w/o: 0.00/12925.14/6041.57) lat (ms,99%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 18836.52 qps: 18836.52 (r/w/o: 0.00/12517.08/6319.44) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 19555.78 qps: 19555.78 (r/w/o: 0.00/12710.11/6845.66) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 19787.43 qps: 19787.43 (r/w/o: 0.00/12466.82/7320.61) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 20361.55 qps: 20361.55 (r/w/o: 0.00/12574.37/7787.18) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 200 tps: 20208.56 qps: 20208.56 (r/w/o: 0.00/12219.86/7988.71) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 200 tps: 21634.68 qps: 21634.68 (r/w/o: 0.00/12733.65/8901.03) lat (ms,99%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 200 tps: 19297.98 qps: 19297.98 (r/w/o: 0.00/11048.19/8249.79) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 200 tps: 22119.75 qps: 22119.75 (r/w/o: 0.00/12303.97/9815.78) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 200 tps: 23132.97 qps: 23132.97 (r/w/o: 0.00/12602.89/10530.08) lat (ms,99%): 27.66 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 200 tps: 23664.03 qps: 23664.03 (r/w/o: 0.00/12521.82/11142.21) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 200 tps: 23467.37 qps: 23467.37 (r/w/o: 0.00/12022.38/11444.99) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 200 tps: 24456.71 qps: 24456.71 (r/w/o: 0.00/12130.05/12326.65) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 200 tps: 24803.80 qps: 24803.80 (r/w/o: 0.00/11964.90/12838.90) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 200 tps: 25252.96 qps: 25252.96 (r/w/o: 0.00/11772.38/13480.58) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 200 tps: 26869.23 qps: 26869.23 (r/w/o: 0.00/12115.41/14753.82) lat (ms,99%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 200 tps: 26599.17 qps: 26599.17 (r/w/o: 0.00/11607.67/14991.50) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 200 tps: 27243.61 qps: 27243.61 (r/w/o: 0.00/11537.20/15706.40) lat (ms,99%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 200 tps: 28814.97 qps: 28814.97 (r/w/o: 0.00/11785.71/17029.26) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 200 tps: 26592.98 qps: 26592.98 (r/w/o: 0.00/10475.31/16117.67) lat (ms,99%): 39.65 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 200 tps: 30596.19 qps: 30596.19 (r/w/o: 0.00/11594.52/19001.67) lat (ms,99%): 26.68 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 200 tps: 30899.46 qps: 30899.46 (r/w/o: 0.00/11358.70/19540.76) lat (ms,99%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 200 tps: 32785.85 qps: 32785.85 (r/w/o: 0.00/11509.62/21276.23) lat (ms,99%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 200 tps: 32995.99 qps: 32995.99 (r/w/o: 0.00/11086.33/21909.66) lat (ms,99%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 200 tps: 34569.38 qps: 34569.38 (r/w/o: 0.00/11159.99/23409.39) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 200 tps: 36207.92 qps: 36207.92 (r/w/o: 0.00/11213.16/24994.76) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 200 tps: 37160.14 qps: 37160.14 (r/w/o: 0.00/10984.78/26175.35) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 200 tps: 38021.66 qps: 38021.66 (r/w/o: 0.00/10724.96/27296.70) lat (ms,99%): 25.28 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 200 tps: 38650.76 qps: 38650.76 (r/w/o: 0.00/10373.44/28277.31) lat (ms,99%): 25.74 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 200 tps: 40166.25 qps: 40166.25 (r/w/o: 0.00/10224.81/29941.44) lat (ms,99%): 26.20 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 200 tps: 41212.04 qps: 41212.04 (r/w/o: 0.00/9974.56/31237.48) lat (ms,99%): 27.17 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 200 tps: 34121.89 qps: 34121.89 (r/w/o: 0.00/7945.37/26176.51) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 200 tps: 45089.99 qps: 45089.99 (r/w/o: 0.00/9961.64/35128.35) lat (ms,99%): 23.52 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 200 tps: 45715.02 qps: 45715.02 (r/w/o: 0.00/9621.29/36093.73) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 200 tps: 48853.37 qps: 48853.37 (r/w/o: 0.00/9545.12/39308.26) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 200 tps: 49602.15 qps: 49602.15 (r/w/o: 0.00/9163.35/40438.80) lat (ms,99%): 24.83 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 200 tps: 52417.82 qps: 52417.82 (r/w/o: 0.00/9119.24/43298.58) lat (ms,99%): 22.28 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 200 tps: 54018.07 qps: 54018.07 (r/w/o: 0.00/8688.95/45329.13) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 200 tps: 56698.97 qps: 56698.97 (r/w/o: 0.00/8584.86/48114.12) lat (ms,99%): 21.50 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 200 tps: 57912.97 qps: 57912.97 (r/w/o: 0.00/8197.40/49715.57) lat (ms,99%): 21.89 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 200 tps: 58893.71 qps: 58893.71 (r/w/o: 0.00/7709.38/51184.33) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           3494504
        other:                           4782533
        total:                           8277037
    transactions:                        8277037 (27587.38 per sec.)
    queries:                             8277037 (27587.38 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0285s
    total number of events:              8277037

Latency (ms):
         min:                                    0.60
         avg:                                    7.25
         max:                                 3538.98
         99th percentile:                       28.16
         sum:                             59997153.59

Threads fairness:
    events (avg/stddev):           41385.1850/232.33
    execution time (avg/stddev):   299.9858/0.01